#+TITLE: August 2-14, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-08-02 Fri>
  :wpd-akshay196: 1
  :wpd-gandalfdwite: 1
  :END:
** akshay196
*** UNIX and Linux System Administration Handbook - Part III
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1555438527
    :TASKID: READ.1555438527
    :END:
    - [ ] Chapter 17. Single Sign-On                        ( 2h)
      - Core SSO elements
      - LDAP: “lightweight” directory services
      - Using directory services for login
      - Alternative approaches
    - [ ] Chapter 18. Electronic Mail                       ( 2h)
      - Mail system architecture
      - Anatomy of a mail message
      - The SMTP protocol
      - Spam and malware
      - Message privacy and encryption
      - Mail aliases
      - Email configuration
      - sendmail
      - Exim
      - Postfix
    - [ ] Chapter 19. Web Hosting                           ( 2h)
      - HTTP: the Hypertext Transfer Protocol
      - Web software basics
      - Web hosting in the cloud
      - Apache httpd
      - NGINX
      - HAProxy
    - [ ] Chapter 20. Storage                               ( 3h)
      - I just want to add a disk!
      - Storage hardware
      - Storage hardware interfaces
      - Attachment and low-level management of drives
      - The software side of storage: peeling the onion
      - Disk partitioning
      - Logical volume management
      - RAID: redundant arrays of inexpensive disks
      - Filesystems
      - Traditional filesystems: UFS, ext4, and XFS
      - Next-generation filesystems: ZFS and Btrfs
      - ZFS: all your storage problems solved
      - Btrfs: “ZFS lite” for Linux
      - Data backup strategy
    - [ ] Chapter 21. The Network File System               ( 2h)
      - Meet network file services
      - The NFS approach
      - Server-side NFS
      - Client-side NFS
      - Identity mapping for NFS version 4
      - nfsstat: dump NFS statistics
      - Dedicated NFS file servers
      - Automatic mounting
*** GNU Emacs bug triaging - Part II
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: OPS.1563244949
    :TASKID: OPS.1563244949
    :END:
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33092][#33092]]: 26.1; Re-running shell wipes font-lock from xterm-color
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33147][#33147]]: tex-mode: ${{{{a}}}}$ or more braces not highlighted
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32388][#32388]]: 26.1: ediff-merge-directories-with-ancestor and subdirectories
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=31306][#31306]]: 27.0.50; js-mode still missing ES2015 keywords
** gandalfdwite
*** IN_PROGRESS Work on Chaostoolkit Part II [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   4.80
    :OWNER: gandalfdwite
    :ID: DEV.1563199235
    :TASKID: DEV.1563199235
    :END:
    :LOGBOOK:
    CLOCK: [2019-08-05 Mon 20:40]--[2019-08-05 Mon 21:45] =>  1:05
    CLOCK: [2019-08-04 Sun 22:09]--[2019-08-04 Sun 23:40] =>  1:31
    CLOCK: [2019-08-03 Sat 21:26]--[2019-08-03 Sat 23:38] =>  2:12
    :END:
    - [ ] Working on Issue      ( 4h )
      - Issue: #117 [[https://github.com/chaostoolkit/chaostoolkit/issues/117][Add --ignore option]]

*** TODO Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi)
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:

    - [ ] 10. Sorting                          ( 2h)
    - [ ] 11. Searching                        ( 2h)
    - [ ] 12. Selection Algorithms (Medians)   ( 1h)
    - [ ] 13. Symbol Tables                    ( 1h)
*** TODO Site Reliability
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1564687028
    :TASKID: READ.1564687028
    :END:
    - [ ] System design for Site Reliability    ( 3h )
